[
  {
    "title": "BMW X6",
    "originalPrice": 250000,
    "resalePrice": 150000,
    "yearsOfUse": 7,
    "postDate": "27/10/2021",
    "sellerName": "Tom crus",
    "sellerStatus": "verified",
    "model": "X6 mercedes",
    "speed": "Ph 200kh",
    "color": "red",
    "weight": "150",
    "images": "https://i.ibb.co/9sNyQDZ/car6.jpg",
    "description": "The creation of BMW X6 was inspired from the automaker’s previous models, the series of BMW 5 and 6. Formally known as E71 in its first generation, the X6 was introduced in the automobile industry as the unique Sports Activity Coupe (or SAC)."
  },
  {
    "title": "Mercedes-Benz SLS AMG",
    "originalPrice": 450000,
    "resalePrice": 350000,
    "yearsOfUse": 2,
    "postDate": "26/12/2021",
    "sellerName": "Jerry boy",
    "sellerStatus": "verified",
    "model": "AMG GT",
    "speed": "Ph 2000kh",
    "color": "gray",
    "weight": "200",
    "images": "https://i.ibb.co/tCKrxXQ/car1.jpg",
    "description": "Described as the spiritual successor to the legendary 300SL Gullwing supercar of 1950s, the AMG SLS was the proof that the 2010s are going to be a huge decade for Mercedes-Benz. The SLS immediately became a dream car of every car enthusiast, featuring the recognizable gullwing door design and up to 622 horses of raw power coming from the 6.2L V8.But that's not all, in 2013 the model received its limited electric variant, which became the most powerful production Mercedes ever created, boasting a combined output of 740 horsepower. Unfortunately, the public was not prepared for this monster, and the model was discontinued in 2015 to give us the following car on this list. However, a true successor, powerful enough to replace the SLS is still to be announced."
  },
  {
    "title": "Mercedes-Benz G-Class",
    "originalPrice": 400000,
    "resalePrice": 300000,
    "yearsOfUse": 4,
    "postDate": "29/04/2022",
    "sellerName": "Jerry boy",
    "sellerStatus": "verified",
    "model": "X7 G-Class",
    "speed": "Ph 170kh",
    "color": "Black",
    "weight": "180",
    "images": "https://i.ibb.co/s2mCszp/car4.jpg",
    "description": "The G-Class definitely needs no introduction, as one of the most popular and desirable off-roaders of the 20th century, the model has now become a symbol of luxury. It features one of the most recognizable boxy designs ever, yet no one can deny its aesthetic appeal. In fact, it's this unique design and image that makes the G-Class stand in a segment of its own, offering both top-end luxury and one of the best off-road performances of any modern luxury SUV.Of course, in the 2010s, the G-Class switched to a fully digitized interior with a massive 12.3 infotainment panel and numerous driver assistance and comfort features. And, for the 2019 model year, the G-Series keeps its recipe for success - a luxurious interior and a monstrous engine lineup that starts at 416 horsepower and goes up to 577 hp."
  },
  {
    "title": "Mercedes-Benz EQC",
    "originalPrice": 300000,
    "resalePrice": 200000,
    "yearsOfUse": 3,
    "postDate": "28/07/2022",
    "sellerName": "Alekgender",
    "sellerStatus": "verified",
    "model": "WYX7 EQC",
    "speed": "Ph 160kh",
    "color": "Brown",
    "weight": "170",
    "images": "https://i.ibb.co/mFNkyMJ/car2.jpg",
    "description": "Earlier this year, Mercedes debuted their entry into the EV market with the all-new EQ lineup. The EQC is a fully-electric SUV that runs on an 80kWH lithium-ion battery pack connected to two electric motors producing 402 horsepower - more than enough to pull the weight of the 5350-lb luxury SUV."
  },
  {
    "title": "Mercedes-Benz SL-Class",
    "originalPrice": 3700000,
    "resalePrice": 300000,
    "yearsOfUse": 5,
    "postDate": "26/06/2022",
    "sellerName": "Sakib Mia",
    "sellerStatus": "verified",
    "model": "SL-Class",
    "speed": "Ph 190kh",
    "color": "White gray",
    "weight": "190",
    "images": "https://i.ibb.co/tCKrxXQ/car1.jpg",
    "description": "In 2012, Mercedes-Benz introduced the sixth and latest generation of their luxury sports convertible lineup branded SL-Class. The new SL featured an all-new aluminum framework that drastically reduced the weight of the car, paired with a new line of powerful petrol engines.This attractive roadster stashes up to 6 liters of engine under its large hood, jetting out an insane dose of 630 horsepower. This SL AMG was Mercedes's answer to cool sports convertibles such as the Lamborghini Aventador, but step inside and you'll find that high-end leather-clad interior with wooden accents and top-end comfort features we're all used to from Mercedes, and the newest model starts at just about $90,000."
  },
  {
    "title": "Mercedes-AMG C 63 S",
    "originalPrice": 3700000,
    "resalePrice": 2900000,
    "yearsOfUse": 5,
    "postDate": "15/09/2022",
    "sellerName": "Tamim Mia",
    "sellerStatus": "verified",
    "model": "C 63 S",
    "speed": "Ph 160kh",
    "color": "Golden",
    "weight": "190",
    "images": "https://i.ibb.co/4sFKFmH/car3.jpg",
    "description": "The C-Class sedan is doing wonderfully on the market, competing for the top spot in the luxury compact sedan segment with the likes of Audi's A4 and Genesis' G70. However, it's the special C 63 AMG coupe variant that we'd like to give special attention to."
  }
]
