[
  {
    "title": " Nissan Ariya",
    "originalPrice": 900000,
    "resalePrice": 700000,
    "yearsOfUse": 2,
    "postDate": "04/07/2022",
    "sellerName": "Akram Hossain",
    "sellerStatus": "verified",
    "model": "Nissan S77",
    "speed": "Ph 250kh",
    "color": "Gray",
    "weight": "230",
    "images": "https://i.ibb.co/DVhCxXv/elec1.jpg",
    "description": "The Ariya range starts with a 63kWh (usable) battery option, coupled with a 215bhp electric motor that provides a claimed 250 miles of range. A larger 87kWh battery option is also available with a choice of a 239bhp single-motor or 302bhp dual-motor e-4ORCE powertrains too, with the latter offering a seriously quick 5.7-second 0-62mph time. But the Ariya isn't just about the numbers, we rate it so highly because it performs strongly across the board. It's the highest quality Nissan we've seen yet, an exceptional EV and our 2022 Car of the Year."
  },
  {
    "title": " MG 4",
    "originalPrice": 900000,
    "resalePrice": 700000,
    "yearsOfUse": 2,
    "postDate": "04/12/2021",
    "sellerName": "Akram Hossain",
    "sellerStatus": "verified",
    "model": "MG 4",
    "speed": "Ph 250kh",
    "color": "Gray",
    "weight": "230",
    "images": "https://i.ibb.co/TWSqc6M/elec3.jpg",
    "description": "MG is doing great things at the more affordable end of the electric car market at a time when costs are at the forefront of everyone’s thinking. The MG 4 is an electric family hatchback at a price that undercuts many smaller supermini-sized rivals. It’s good to drive, debuts a sharp new styling direction for the brand and comes with impressive rapid charging abilities. At the price, it’s very hard to criticise.There are two powertrain options both using a rear-mounted electric motor to power the rear wheels. A 51kWh battery model with 168bhp opens the range or there’s the option to upgrade to a 64kWh battery and 200bhp. The 281-mile maximum range of the SE Long Range model is impressive, as is its 150kW rapid charging capability.The MG 4’s interior might not have quite the same high-class feel and advanced technology as some rivals but there’s a lot of space in there with decent rear legroom and a 363-litre boot. It’s functional and practical, while the MG 4’s value-for-money credentials make it a truly competitive electric car that’s hard to ignore."
  },
  {
    "title": "Renault Megane E-Tech",
    "originalPrice": 800000,
    "resalePrice": 600000,
    "yearsOfUse": 2,
    "postDate": "04/11/2021",
    "sellerName": "Akram Hossain",
    "sellerStatus": "verified",
    "model": "E-Tech",
    "speed": "Ph 240kh",
    "color": "White",
    "weight": "230",
    "images": "https://i.ibb.co/d7KntCx/elec2.jpg",
    "description": "Renault’s well-known Megane family hatchback has morphed into an electric-only model for its latest fifth generation, albeit one with obvious crossover styling cues. It shares technology with the slightly larger Nissan Ariya and impresses with its high quality cabin, large boot and user-friendly infotainment system.Known as the Megane E-Tech, the car is only available in pure electric form and the advanced CMF-EV platform that it shares with the Ariya actually allows a decent weight saving compared to rivals like the Volkswagen ID.3. At 1,636kg, the Renault is around 200kg lighter than the VW. That modest (for an EV) weight helps the 217bhp Megane to a 7.5s 0-62mph sprint and a 99mph top speed. All models have the same 60kWh battery and 280-mile WLTP range.Unlike its predecessors that were firmly in the family hatchback camp, the new electric Megane E-Tech treads the line between hatchback and SUV. The car is relatively compact by modern EV standards, and manoeuvrable at 4,200mm long, but it offers a lot more cabin space than traditional family hatches like the Ford Focus and Volkswagen Golf. The 440-litre boot enhances the Megane’s family car credentials further. "
  },
  {
    "title": " Hyundai Ioniq 5",
    "originalPrice": 600000,
    "resalePrice": 300000,
    "yearsOfUse": 4,
    "postDate": "07/02/2022",
    "sellerName": "Akram Hossain",
    "sellerStatus": "verified",
    "model": "Ioniq 5",
    "speed": "Ph 247kh",
    "color": "White",
    "weight": "280",
    "images": "https://i.ibb.co/MMSXwnm/elec4.jpg",
    "description": "Two battery options are available with three power outputs: the entry 58kWh battery is paired with a single 168bhp motor driving the rear wheels, delivering a 0-62mph time of 8.5 seconds and a range of 238 miles. The 214bhp mid-spec version offers the best range, with a 73kWh battery increasing the total distance able to be covered on a single charge to 280 miles. The top-spec variant uses the same 73kWh battery, but adds a second motor at the front, giving a combined total of 301bhp and 605Nm of torque. Overall range falls slightly to 267 miles, although performance is much improved with 0-62 taking 5.2 seconds. Starting from around £42,000, the Ioniq 5 features a superb infotainment system and generous standard kit, while the available space has to be seen to be believed. It's comfortable, too, so you'll relish the chance of racking up the miles. We certainly did, which is why we named the Hyundai Ioniq 5 our Car of the Year for 2021."
  },
  {
    "title": "Kia EV6",
    "originalPrice": 600000,
    "resalePrice": 300000,
    "yearsOfUse": 4,
    "postDate": "07/02/2022",
    "sellerName": "Akram Hossain",
    "sellerStatus": "verified",
    "model": "Kia EV6",
    "speed": "Ph 297kh",
    "color": "Blue",
    "weight": "280",
    "images": "https://i.ibb.co/Xt6V139/elec5.jpg",
    "description": "The Kia EV6 is the sister vehicle to the Hyundai Ioniq 5, so it's a great pick if you love that model's technology, but aren't quite as sold on its retro-futuristic looks. The EV6 is arguably the more conventional of the two, and it's a bit lower and more sporting. This is reflected in its handling, with slightly firmer suspension offering sharper responses.Advertisement - Article continues below It's offered in Long Range RWD, Long Range AWD and a high-performance GT version, and the entry-level version is our favourite. It not only offers the best range figure of up to 328 miles from its 77.4kWh battery, but we also found its 7.2-second 0-62mph time to be quick enough. With all-wheel drive, the next step up is undeniably faster, lopping two seconds off its benchmark sprint time. But it also has a slightly shorter range, costs considerably more and doesn't feel entirely comfortable to drive quickly. Every version features impressive ultra-rapid charging at up to 250kW, so if you can find a fast enough public charger, a top up from 10 to 80% is possible in less than 20 minutes. Its interior is no less desirable, thanks to a dashboard dominated by a pair of curved 12.3-inch screens for the instruments and infotainment setup."
  },
  {
    "title": "Fiat 500",
    "originalPrice": 700000,
    "resalePrice": 500000,
    "yearsOfUse": 1,
    "postDate": "07/02/2022",
    "sellerName": "Akram Hossain",
    "sellerStatus": "verified",
    "model": "Fiat 500",
    "speed": "Ph 250kh",
    "color": "Blue",
    "weight": "200",
    "images": "https://i.ibb.co/F8jV19M/elec6.jpg",
    "description": "The Fiat 500 nails its city car brief perfectly; it's competitively priced, offering low running costs and plenty of Italian flair. Although the third generation car is a little bigger than its combustion-engined predecessor, the 500 EV is still at home darting through urban traffic, while you shouldn't have any trouble parking as even the entry-level models come with rear parking sensors as standard. Two battery options are available: a 42kWh ‘Long Range’ version and a 24kWh ‘City Range’ variant. The City Range offers up to 115 miles of range from a single charge, although the bigger battery gives you a more practical 199 miles before needing to recharge.Inside, the cabin is suitably stylish, while you'll benefit from a host of on-board tech. Base cars offer a 7-inch infotainment screen with wireless Apple CarPlay and Android Auto connectivity, while moving up through mid- and top-spec models brings a rear-view camera and a 10.25-inch infotainment touchscreen."
  }
]
