[
  {
    "title": "Toyota Motors",
    "originalPrice": 5700000,
    "resalePrice": 3900000,
    "yearsOfUse": 5,
    "postDate": "15/011/2021",
    "sellerName": "Alif Bin Casim",
    "sellerStatus": "verified",
    "model": "Toyota X98",
    "speed": "Ph 150kh",
    "color": "white",
    "weight": "250",
    "images": "https://i.ibb.co/Tbb77X1/micro1.jpg",
    "description": "Toyota is the top bus manufacturer in the world in 2022. This largest multinational automotive company created a workplace for more than 3,64,445 people. It serves worldwide. Almost every road in every country has a Toyota vehicle. It has been declared as the second largest company in the world. It produces 10 million different types of vehicles almost, in a year."
  },
  {
    "title": "Volkswagen AG",
    "originalPrice": 4700000,
    "resalePrice": 3900000,
    "yearsOfUse": 15,
    "postDate": "15/011/2021",
    "sellerName": "Alif Bin Casim",
    "sellerStatus": "verified",
    "model": "AG X8",
    "speed": "Ph 157kh",
    "color": "white",
    "weight": "240",
    "images": "https://i.ibb.co/b1cNtBQ/micro2.png",
    "description": "Volkswagen AG is another biggest multinational automotive company in the world. It manufactures commercial transports. By sale it is the world’s largest automotive company. It sold 10.9 million vehicles in the year 2019. It has its biggest market in Europe and the company being able to hold it for over 2 decades. It made its place in the top list of Fortune Global 500. Volkswagen sells vehicles under different brands. Such as Bugatti, Lamborghini, SEAT, Audi, Bentley etc."
  },
  {
    "title": "Volvo",
    "originalPrice": 4700000,
    "resalePrice": 5900000,
    "yearsOfUse": 13,
    "postDate": "15/011/2021",
    "sellerName": "Alif Bin Casim",
    "sellerStatus": "verified",
    "model": "Volvo H9G",
    "speed": "Ph 170kh",
    "color": "Light pink",
    "weight": "270",
    "images": "https://i.ibb.co/1G1jSJk/micro6.png",
    "description": "Volvo is one of the best bus manufacturer in the world 2022. Volvo buses serve worldwide. This is a subsidiary of Volvo. This is one of the biggest bus manufacturers in the world. Volvo launched its first city bus in the year 1983 with the model B9M. Volvo 9700 DD is the most developed double-deck bus of Volvo. This is the most comfortable, safe and flexible bus according to the customers which can carry 96 passengers together. Nowadays Volvo buses are manufacturing smarter buses with all the best features. Volvo bus sold 307 Prevost commuter buses in New York recently."
  },
  {
    "title": "Daimler AG",
    "originalPrice": 3500000,
    "resalePrice": 200000,
    "yearsOfUse": 6,
    "postDate": "15/09/2021",
    "sellerName": "Alif Bin Casim",
    "sellerStatus": "verified",
    "model": "AG H9G",
    "speed": "Ph 120kh",
    "color": "White",
    "weight": "270",
    "images": "https://i.ibb.co/1G1jSJk/micro6.png",
    "description": "Daimler is a leading global bus manufacturer company in the world. It was founded in 1926. The headquarters of this company is situated in Stuttgart, Germany. The net worth is around $32.36 billion. Karl Benz is the owner of this company. Daimler is producing automobiles, commercial innovative vehicles, enviro-friendly products, and many servicing centers. With Mercedes-Benz, BharatBenz as well as Setra brands, Daimler is covering every part as a leading bus supplier in the global market. Daimler manufacturer is known for its efficiency, innovative production, environmental balance, and utmost safety that can fulfill customers’ requirements."
  },
  {
    "title": "Scania AB",
    "originalPrice": 4500000,
    "resalePrice": 2500000,
    "yearsOfUse": 9,
    "postDate": "17/07/2022",
    "sellerName": "Iqbal Hossain",
    "sellerStatus": "verified",
    "model": "Scania AB",
    "speed": "Ph 124kh",
    "color": "White",
    "weight": "270",
    "images": "https://i.ibb.co/fHv2Q2Q/micro4.jpg",
    "description": "Scania AB is one of the largest swedes automotive companies worldwide. It was established in 1891. The very first bus of this company was Metropol C50. Volkswagen Group, the automotive German company is the owner of this company. The estimated net worth is near $12.33 billion. The company is popular for its diesel engines and commercial advanced vehicles. Currently, Scania is providing its sales and financial services worldwide except North America. There are 52103 employees in this multinational company. Scania produces its product in different countries such as Argentina, Brazil, Russia, Poland, India, Sweden, Finland, etc."
  },
  {
    "title": "Kamaz",
    "originalPrice": 400000,
    "resalePrice": 300000,
    "yearsOfUse": 9,
    "postDate": "17/07/2022",
    "sellerName": "Iqbal Hossain",
    "sellerStatus": "verified",
    "model": "Kamaz SB7",
    "speed": "Ph 127kh",
    "color": "White",
    "weight": "230",
    "images": "https://i.ibb.co/fGc7Cb8/micro5.jpg",
    "description": "Kamaz is one of the oldest bus manufacturers who has been standing in a strong ground in the business world for the long 51 years. The company has introduced the automotive world with the electric bus for the first time in the year 2018. The bus has Lithium Titanate batteries. These super batteries could be charged fully in only 10 to 25 minutes. The bus has 27 seats, which is able to carry 85 passengers in it. Kamaz has signed an agreement of selling 511 electric buses and 462 large urban low floor buses to Moscow for 6.5 billion rubles."
  }
]
